//clearrunk.h		クリアランク表示
//20106_田中蓮
//23_06_22
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitClearrunk(void);
void UninitClearrunk(void);
void UpdateClearrunk(void);
void DrawClearrunk(void);

