//coin_screen.h		コイン枚数表示
//20106_田中　蓮
//23_12_27
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitCoinscreen(void);
void UninitCoinscreen(void);
void UpdateCoinscreen(void);
void DrawCoinscreen(void);

