//logo.h	ロゴ表示管理
//20106_田中蓮
//23_09_22
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLogo(void);
void UninitLogo(void);
void UpdateLogo(void);
void DrawLogo(void);

void LerpLogo(void);
bool GetEndLerpLogo(void);
