//pushspace.h	プッシュスペース表示管理
//20106_田中蓮
//23_09_22
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPushspace(void);
void UninitPushspace(void);
void UpdatePushspace(void);
void DrawPushspace(void);

void LerpPush(void);
bool GetEndLerp(void);
