//second_screen.h		タイム表示
//20106_田中　蓮
//24_01_01
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSecondscreen(void);
void UninitSecondscreen(void);
void UpdateSecondscreen(void);
void DrawSecondscreen(void);

