//trout_red.cpp	敵が出るマス
//20106_田中　蓮
//23_12_08
#include "trout_red.h"
#include "texture.h"
#include "renderer.h"
#include "sound.h"
//*****************************************************************************
// グローバル変数
//*****************************************************************************


//=============================================================================
// 初期化処理
//=============================================================================
void TROUT_RED::Init(void){
	//音声読み込み
	SetSound(LoadSound((char*)"data/sound/enemy_pop.wav"));
	SetVolume(GetSoundNo(), 0.3f);

	TROUT::Init();

	_em = new ENEMY_MANAGER();
}

//=============================================================================
// 終了処理
//=============================================================================
void TROUT_RED::Uninit(void)
{
	if (_em != nullptr) {
		_em->UninitEnemyManager();
	}
	TROUT::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void TROUT_RED::Update(void)
{
	_em->UpdateEnemyManager();

	if (_em->GetSize() == 0) {
		_eventend = true;
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void TROUT_RED::Draw(void)
{
	TROUT::Draw();

	_em->DrawEnemyManager();
}

//イベント
void TROUT_RED::Event(){
	//音声再生
	PlaySound(GetSoundNo(), 0);
	
	//イベント終了状態にする
	_eventend = false;

	//敵を出現させる
	_em->Add(new ENEMY({ 0.0f, 0.0f, 300.0f }, true));
	_em->Add(new ENEMY({ 0.0f, 0.0f, -300.0f }, true));
	_em->Add(new ENEMY({ 300.0f, 0.0f, 0.0f }, true));
	_em->InitEnemyManager();
}

